{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality with product management, shopping cart, orders, and blob storage mixin; includes migration support and defines Product, Category, CartItem, and Order types.",
  "backend/migration.mo": "Migration module that transforms old actor state to new schema, converting text-based categories to enum variants and adding new fields like videoPreviewUrl, downloadUrl, isMegaBundle, and downloadLinks.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including cyberpunk color scheme, hero section updates, search bar addition, category reorganization, and their associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages describing their functionality, styling with cyberpunk theme, and key implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, cards, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx; sets page title to 'Digital Marketing Shop'.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, product detail, checkout, order confirmation, and DMCA pages; wraps app in ThemeProvider with dark mode default and includes Toaster.",
  "frontend/src/components/AddToCartButton.tsx": "Reusable button component for adding products to cart with loading, success states, and toast notifications; displays checkmark icon when item is successfully added.",
  "frontend/src/components/CartDrawer.tsx": "Slide-out sheet component displaying cart contents with scrollable item list, total price calculation, and checkout button; shows empty state when cart has no items.",
  "frontend/src/components/CartItem.tsx": "Displays a single cart item with product image, name, price, quantity controls (increment/decrement), and a remove button. Integrates with the cart store to update quantities and remove items.",
  "frontend/src/components/CartSummary.tsx": "Shows an order summary card with subtotal, optional tax and shipping, and a total with gradient styling. Accepts props for subtotal, tax, and shipping amounts.",
  "frontend/src/components/CheckoutForm.tsx": "A form component using react-hook-form for collecting customer contact and address information during checkout. Validates required fields (name and email) and includes optional address fields.",
  "frontend/src/components/Footer.tsx": "Site footer with branding, product/company links, social media icons, DMCA link, and a caffeine.ai attribution. Displays current year and uses gradient styling consistent with the site theme.",
  "frontend/src/components/Hero3D.tsx": "Hero section with 3D scene background, collage overlay, and prominent call-to-action promoting 5000+ premium assets. Features gradient text, navigation buttons to products page, and animated sparkle badge.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with Navigation header, main content outlet, and Footer. Provides consistent structure across the application.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar with logo, product search, navigation links, user icon, and cart button with item count badge. Includes mobile menu drawer and integrates with CartDrawer component.",
  "frontend/src/components/OrderSummary.tsx": "Displays a scrollable list of cart items with quantities and prices, plus subtotal, shipping (free), and total. Used in checkout flow to review order before payment.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image/video preview, category badge, name, description, price, and add-to-cart button. Supports hover-triggered video playback and navigation to product detail page.",
  "frontend/src/components/ProductFilters.tsx": "Provides filtering UI for products with category dropdown and price range slider. Displays filters in a card layout with neon-themed styling.",
  "frontend/src/components/ProductGrid.tsx": "Renders a responsive grid of product cards with loading skeletons and empty state handling. Supports 1-3 column layout based on screen size.",
  "frontend/src/components/ProductSearch.tsx": "Search input component with debounced search functionality (300ms delay) and search icon. Triggers callback with search term on input change.",
  "frontend/src/components/Scene3D.tsx": "Renders an interactive 3D scene using React Three Fiber with floating geometric shapes (sphere, box, torus, octahedron), lighting, and auto-rotating camera controls.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages auth client creation, identity persistence, and login status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching products, orders, and download links from the backend actor. Includes mutations for checkout and automatic cache invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom cyberpunk-themed color palette (neon blue, electric purple, dark charcoal), light/dark mode variables, and neon shadow utilities.",
  "frontend/src/lib/cartStore.ts": "Zustand store with persistence for shopping cart state, managing cart items (add, remove, update quantity, clear) and calculating totals.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component that displays a checkout form and order summary, handles order submission via mutation, and redirects to order confirmation on success.",
  "frontend/src/pages/DMCAPage.tsx": "Static informational page displaying DMCA/copyright policy, educational disclaimers, GPL licensing information, and resell rights terms in card layouts.",
  "frontend/src/pages/Home.tsx": "Homepage component featuring a 3D hero section, mega bundle promotional card with pricing, and a grid of featured products.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays order details and download links for purchased digital products using the orderId route parameter.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page showing product information, media preview (image/video), add-to-cart functionality, and frequently bought together recommendations with bundle pricing.",
  "frontend/src/pages/Products.tsx": "Products listing page with search, category filters, price range filtering, and a grid display of filtered products.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining a dark mode theme with custom color palettes (neonBlue, electricPurple, darkCharcoal) using OKLCH color space, container settings, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a digital product marketplace for Instagram Reels and video editing content with 3D rendering, cyberpunk aesthetic, guest checkout, and features including shopping cart, product catalog, payment integration, and mobile-first design."
}