{
  "backend/main.mo": "Motoko backend actor implementing product catalog, shopping cart, and order management with in-memory storage using Maps and Lists.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (3D homepage, product catalog, cart, checkout) to source files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and styling for the digital marketing shop.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining light and dark theme color palettes using OKLCH color space.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, products, product detail, checkout, and order confirmation pages.",
  "frontend/src/components/AddToCartButton.tsx": "Button component for adding products to cart with loading, success states, and toast notifications using Zustand store.",
  "frontend/src/components/CartDrawer.tsx": "Slide-out sheet component displaying cart items with scrollable list, total calculation, and checkout navigation.",
  "frontend/src/components/CartItem.tsx": "Cart item row component with product display, quantity controls (increment/decrement), and remove button.",
  "frontend/src/components/CartSummary.tsx": "Card component displaying order pricing breakdown including subtotal, optional tax and shipping, and total with gradient styling.",
  "frontend/src/components/CheckoutForm.tsx": "React form component using react-hook-form for collecting shipping information (name, email, address fields) with validation. Accepts onSubmit callback and isSubmitting prop to handle form submission state.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company branding, product/company links, social media icons, and copyright notice with caffeine.ai attribution. Uses current year and hostname for dynamic content.",
  "frontend/src/components/Hero3D.tsx": "Full-screen hero section with 3D scene background, gradient overlays, and CTA buttons. Features animated heading with gradient text and navigation to products page.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with Navigation header, main content outlet, and Footer. Provides consistent page structure across the application.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation header with logo, links to home/products, shopping cart button with item count badge, and mobile menu drawer. Integrates with cart store and CartDrawer component.",
  "frontend/src/components/OrderSummary.tsx": "Card component displaying cart items with quantities, prices, subtotal, shipping (free), and total. Uses cart store and includes scrollable area for item list.",
  "frontend/src/components/ProductCard.tsx": "Card component for displaying individual product with image, name, category badge, description, price, and add-to-cart button. Includes hover effects and navigation to product detail page.",
  "frontend/src/components/ProductFilters.tsx": "Filter panel component with category dropdown and price range slider. Accepts current filter values and callbacks for updating category and price range selections.",
  "frontend/src/components/ProductGrid.tsx": "Grid layout component for displaying product cards with loading skeletons and empty state. Renders products in responsive 1-3 column grid based on screen size.",
  "frontend/src/components/ProductSearch.tsx": "Search input component with debounced search functionality (300ms delay). Triggers onSearch callback with search term after user stops typing.",
  "frontend/src/components/Scene3D.tsx": "Renders a 3D scene using React Three Fiber with floating geometric shapes (sphere, box, torus, octahedron) that have metallic materials, distortion effects, and auto-rotating orbit controls.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor based on Internet Identity authentication state, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products, individual product details, and handling checkout mutations with automatic cart invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color variables for deep teal, warm gold, and charcoal gray themes, plus light/dark mode support and custom shadow utilities.",
  "frontend/src/lib/cartStore.ts": "Zustand store for shopping cart state management with persistence, handling add/remove/update operations and total price calculation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component that displays order summary and checkout form, handles order submission via backend actor, and redirects to confirmation on success.",
  "frontend/src/pages/Home.tsx": "Home page featuring a 3D hero section, three feature cards highlighting business benefits, and a featured products section with navigation to the full product catalog.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays order details (ID, date, status) with a success message and navigation buttons to continue shopping or return home.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page showing individual product information with image, description, price, category badge, quantity selector, and add-to-cart functionality with loading and error states.",
  "frontend/src/pages/Products.tsx": "Product catalog page with search, category filtering, price range filtering, and a grid display of products using ProductGrid, ProductFilters, and ProductSearch components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (deepTeal, warmGold, charcoalGray), container settings, border radius variables, and extended theme utilities with OKLCH color format.",
  "project_state.json": "Project state tracking document listing implemented features (3D homepage, product catalog, shopping cart, checkout flow) and pending feature requests for an ultra-realistic 3D digital marketing e-commerce website."
}