{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Transform marketplace into cyberpunk-themed digital product store with video previews, mega bundles, and guest checkout",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Replace existing color scheme with dark cyberpunk aesthetic using neon blue and electric purple accents",
      "acceptanceCriteria": [
        "Background colors changed to dark charcoal/matte black throughout the application",
        "Primary action buttons use neon blue (#00f3ff)",
        "Secondary actions and hover states use electric purple (#bd00ff)",
        "Color changes applied consistently across all pages and components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Replace existing color variables with cyberpunk theme colors: set background to #1a1a1a (dark charcoal/matte black), primary colors to #00f3ff (neon blue), and secondary colors to #bd00ff (electric purple). Update all CSS custom properties to support the new color scheme throughout the application."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update Tailwind color palette to include cyberpunk theme: add neonBlue (#00f3ff) and electricPurple (#bd00ff) to the theme.extend.colors section. Replace or extend existing deepTeal, warmGold, and charcoalGray with the new cyberpunk color scheme while maintaining subtle gradient support."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Update hero section with new headline, subheadline, and CTA button text",
      "acceptanceCriteria": [
        "Hero section displays the new headline with emphasis on creative potential",
        "Subheadline includes instant download, lifetime access, and security messaging",
        "CTA button text reads 'Shop All Bundles' and navigates to products page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero3D.tsx",
          "operation": "modify",
          "description": "Replace the hero headline with 'Unlock Your Creative Potential: 5000+ Premium Assets for the Price of a Pizza' and subheadline with 'Instant Download. Lifetime Access. 100% Secure.' Update the primary CTA button text to 'Shop All Bundles' while maintaining navigation to the products page. Ensure visual emphasis and gradient effects on the new headline."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add centered search bar to navigation header with placeholder text",
      "acceptanceCriteria": [
        "Search bar appears in the center of the navigation header",
        "Placeholder text reads 'Search for courses, bundles...'",
        "Search bar integrates with existing product search functionality",
        "Layout remains responsive on mobile devices"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add a centered search bar between the logo and cart icon. Integrate the ProductSearch component with placeholder text 'Search for courses, bundles...' and implement search navigation to the products page with search query parameter. Ensure responsive layout that hides or collapses the search bar on mobile devices."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update frontend category filters to display four new product categories",
      "acceptanceCriteria": [
        "Frontend category filter dropdown shows all four categories",
        "Category badges on product cards display the updated category names"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductFilters.tsx",
          "operation": "modify",
          "description": "Update category filter dropdown to display the four new categories: 'Viral Reels Library', 'Editing Suite', 'Masterclass Courses', and 'Software Tools'. Map these to the backend Category enum values (viralReelsLibrary, editingSuite, masterclassCourses, softwareTools) and ensure proper filtering integration."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Update category badge display to show the new category names with proper formatting. Map backend category enum values to user-friendly labels: viralReelsLibrary → 'Viral Reels Library', editingSuite → 'Editing Suite', masterclassCourses → 'Masterclass Courses', softwareTools → 'Software Tools'."
        },
        {
          "path": "frontend/src/pages/ProductDetail.tsx",
          "operation": "modify",
          "description": "Update category badge display on the product detail page to show the new category names with the same mapping as ProductCard. Ensure consistent category label formatting across the application."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add video preview support with auto-play on hover functionality",
      "acceptanceCriteria": [
        "Product cards display video preview when hovering over the card area",
        "Product detail page shows video preview in a carousel that auto-plays on hover",
        "Video elements include proper controls and fallback to static images when no video is available"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Add video preview functionality that auto-plays when hovering over the product card. Use the videoPreviewUrl field from the Product type. Implement a video element that replaces the static image on hover, with muted auto-play, loop, and proper fallback to the imageUrl when no video is available. Include loading states and error handling."
        },
        {
          "path": "frontend/src/pages/ProductDetail.tsx",
          "operation": "modify",
          "description": "Add video preview carousel or media viewer that displays the product's videoPreviewUrl. Implement auto-play on hover functionality with muted playback, loop, and video controls. Include fallback to static image display when videoPreviewUrl is not available. Ensure the video element is properly sized and responsive."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Implement guest checkout flow without authentication requirements",
      "acceptanceCriteria": [
        "Users can access checkout page without authentication",
        "Checkout form collects email for order confirmation without requiring account creation",
        "Order confirmation page is accessible without login",
        "No authentication prompts appear during the checkout flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Checkout.tsx",
          "operation": "modify",
          "description": "Remove any authentication checks or Internet Identity requirements from the checkout page. Ensure the checkout process works entirely as a guest flow without requiring login or account creation. Verify that the CheckoutForm collects email and shipping information that is passed to the backend checkout capability."
        },
        {
          "path": "frontend/src/pages/OrderConfirmation.tsx",
          "operation": "modify",
          "description": "Ensure the order confirmation page is accessible without authentication. Remove any login prompts or identity checks. Display order details and download links based on the orderId parameter from the route without requiring user authentication."
        },
        {
          "path": "frontend/src/components/CheckoutForm.tsx",
          "operation": "modify",
          "description": "Ensure the checkout form prominently collects email address as a required field for guest checkout. Update form validation and labels to indicate that no account creation is required. Focus on collecting minimal customer information (name, email, optional address) for order fulfillment."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Create Mega Bundle section on homepage with prominent upsell messaging",
      "acceptanceCriteria": [
        "Homepage includes a dedicated Mega Bundle section with eye-catching design",
        "Section displays the bundle product with special pricing and value proposition",
        "Section appears prominently on homepage with clear call-to-action"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add a prominent Mega Bundle section between the hero section and featured products. Fetch the mega bundle product using the getMegaBundleProduct backend capability. Display the bundle with eye-catching cyberpunk styling, special pricing emphasis, value proposition messaging, and a clear CTA button that navigates to the bundle's product detail page or adds it to cart. Use neon blue and electric purple accents for visual emphasis."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook for fetching the mega bundle product using the getMegaBundleProduct backend capability. Export useMegaBundleQuery hook that returns the mega bundle product data with loading and error states."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add Frequently Bought Together recommendation section to product detail pages",
      "acceptanceCriteria": [
        "Product detail page displays related products in a 'Frequently Bought Together' section",
        "Section includes a bundled price calculation showing savings",
        "Users can add all recommended products to cart with one click"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductDetail.tsx",
          "operation": "modify",
          "description": "Add a 'Frequently Bought Together' section below the main product information. Fetch related products using the getFrequentlyBoughtTogether backend capability with the current productId. Display recommended products with images, names, and prices. Calculate and display the bundled price with savings. Include a prominent button to add all recommended products to cart with one click using the cart store's addItem method."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook for fetching frequently bought together products using the getFrequentlyBoughtTogether backend capability. Export useFrequentlyBoughtTogetherQuery hook that accepts a productId parameter and returns related products with loading and error states."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Update product detail page with crossed-out pricing, trust badges, and sticky add-to-cart button",
      "acceptanceCriteria": [
        "Product price displays with original price struck through and sale price emphasized",
        "Trust badge icons for secure payment and instant delivery appear near the add-to-cart button",
        "Add-to-cart button becomes sticky and remains visible when scrolling down the page",
        "Layout maintains visual hierarchy with price and trust elements prominently displayed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductDetail.tsx",
          "operation": "modify",
          "description": "Update the pricing display to show a crossed-out original price (calculated as price * 1.5 or similar markup) next to the sale price with visual emphasis. Add trust badge images below the price using the generated trust badge assets (frontend/public/assets/generated/trust-badge-secure.dim_64x64.png and frontend/public/assets/generated/trust-badge-instant.dim_64x64.png). Implement sticky positioning for the add-to-cart button using CSS position:sticky or a scroll listener, ensuring it remains visible when scrolling down the page. Verify the trust badge image paths reference the generated assets exactly."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Implement digital download delivery system showing download links after order completion",
      "acceptanceCriteria": [
        "Order confirmation page displays download links for purchased products",
        "Download links are only accessible after successful order completion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OrderConfirmation.tsx",
          "operation": "modify",
          "description": "Display download links for purchased products on the order confirmation page. Fetch download links using the getOrderDownloadLinks backend capability with the orderId from the route parameter. Display each download link as a clickable button or link that opens the external URL (Google Drive, Mega.nz, etc.) in a new tab. Include clear instructions for accessing the digital products and emphasize that the links provide lifetime access."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook for fetching order download links using the getOrderDownloadLinks backend capability. Export useOrderDownloadLinksQuery hook that accepts an orderId parameter and returns the array of download link URLs with loading and error states."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Create DMCA/Copyright page with legal disclaimers",
      "acceptanceCriteria": [
        "Footer includes link to DMCA/Copyright page",
        "Page contains educational purpose disclaimer",
        "Page explains GPL licensing for applicable software",
        "Page describes resell rights bundle policies and legal usage terms"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DMCAPage.tsx",
          "operation": "create",
          "description": "Create a new DMCA/Copyright page component that displays legal disclaimers and policies. Include sections for: educational purpose disclaimer ('This software is for educational purposes'), GPL licensing information for software products, resell rights bundle policies, and general legal usage terms. Use clear headings, formatted text, and the cyberpunk theme styling. Structure the content in an accessible and readable format."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for the DMCA/Copyright page at path '/dmca' that renders the DMCAPage component. Ensure the route is registered in the TanStack Router configuration and accessible without authentication."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add a link to the DMCA/Copyright page in the footer's company links section. Use the link text 'DMCA / Copyright' and navigate to '/dmca'. Position it prominently among other legal/informational links to ensure visibility and compliance."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add bullet-point product descriptions showing included files and specifications",
      "acceptanceCriteria": [
        "Product detail page displays description as formatted bullet points",
        "Each bullet point clearly states what is included (file size, format, quality)",
        "Description section is visually distinct and easy to scan"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductDetail.tsx",
          "operation": "modify",
          "description": "Update the product description display to render as formatted bullet points instead of plain text. Parse the product.description field to extract or display bullet points (handle newlines, hyphens, or asterisks as list items). If the description is plain text, present it in a bulleted list format. Ensure each bullet point is visually distinct, easy to scan, and includes details about file size, format, watermark status, and other specifications. Style the list with cyberpunk theme colors and appropriate spacing."
        }
      ]
    }
  ]
}